---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationY
source: html/346dc2de-5f11-73d0-fd56-a073f19136c6.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLinkType.RotationY Property

Fixity of rotation around Y.

## Syntax (C#)
```csharp
public AnalyticalFixityState RotationY { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The fixity state rotationY is not valid for Analytical Link Type parameters.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration